params.json

{"name":"GisService","tagline":"GIS Service to fetch Indonesian's Province, Regency and Sub-District list","body":"A Simple Service for Fetching List of Indonesian Provinces, Regencies, Sub-Districts and Villages.\r\n===================\r\n\r\nTools\r\n-------------------\r\n* Programming Language - Java\r\n* IDE - Netbeans 7.2\r\n* DB - MySQL\r\n* Framework - Hibernate ORM - JaxWS 2.2\r\n* Build Tool - Maven\r\n\r\nHow to Build\r\n-------------------\r\n1. Restore dbgis.sql into existing MySql database.\r\n2. Make sure you have Internet Connection\r\n3. Open project using Netbeans\r\n4. Right click on your project, and build \r\n    (be patience, Maven will download libraries needed automatically)\r\n5. Press F6 to Run your project\r\n6. You will find your service on this url, http://localhost:8084/GISService/Service.\r\n\r\nMessaging\r\n--------------------\r\nThere are 4 requests provided, getProvinsis, getKabupatens, getKecamatans and getDesas. Messaging is done by using xml formats (webservice), and you could get this project's wsdl from  browser (http://localhost:8084/GISService/Service?wsdl) or from Service.wsdl file.\r\n\r\nHere is the example of getProvinsis request.\r\n\r\n```xml\r\n<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:ser=\"http://service.gis.edw.com/\">\r\n   <soapenv:Header/>\r\n   <soapenv:Body>\r\n      <ser:getProvinsis/>\r\n   </soapenv:Body>\r\n</soapenv:Envelope>\r\n```\r\n\r\nand here is the response\r\n```xml\r\n<S:Envelope xmlns:S=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n   <S:Body>\r\n      <ns2:getProvinsisResponse xmlns:ns2=\"http://service.gis.edw.com/\">\r\n         <return>\r\n            <id>11</id>\r\n            <nama>Aceh</nama>\r\n         </return>     \r\n\t\t.....\t\t \r\n\t\t<return>\r\n            <id>94</id>\r\n            <nama>Papua</nama>\r\n\t\t</return>\r\n      </ns2:getProvinsisResponse>\r\n   </S:Body>\r\n</S:Envelope>\r\n```\r\n\r\nAppreciations\r\n--------------------\r\nProvinces, Regencies, Sub-Districts and Villages datas are provided by kind permission from Panji09 (http://www.kaskus.co.id/thread/518298ae8227cf927f000003/sharedatabase-wilayah-indonesia) and from http://mfdonline.bps.go.id/.","google":"","note":"Don't delete this file! It's used internally to help with page regeneration."}